import sqlite3

conn = sqlite3.connect('schedule.db')
cursor = conn.cursor()

lessons = [
    # ПОНЕДЕЛЬНИК
    ("Математика", "06.10.2025", "09:00", "Иванова А.А.", "https://zoom.us/j/111"),
    ("Физика", "06.10.2025", "10:45", "Ким Л.С.", "https://zoom.us/j/112"),
    ("Английский язык", "06.10.2025", "12:30", "Джонсон Э.", "https://zoom.us/j/113"),

    # ВТОРНИК
    ("История", "07.10.2025", "09:00", "Петров В.В.", "https://zoom.us/j/114"),
    ("Информатика", "07.10.2025", "10:45", "Сидоров Н.Н.", "https://zoom.us/j/115"),
    ("Биология", "07.10.2025", "12:30", "Ахметова Д.К.", "https://zoom.us/j/116"),

    # СРЕДА
    ("География", "08.10.2025", "09:00", "Орлова Т.П.", "https://zoom.us/j/117"),
    ("Русский язык", "08.10.2025", "10:45", "Никитина В.И.", "https://zoom.us/j/118"),
    ("Физкультура", "08.10.2025", "12:30", "Жумабаев А.К.", "https://zoom.us/j/119"),

    # ЧЕТВЕРГ
    ("Химия", "09.10.2025", "09:00", "Орлова Т.П.", "https://zoom.us/j/120"),
    ("Математика", "09.10.2025", "10:45", "Иванова А.А.", "https://zoom.us/j/121"),
    ("Английский язык", "09.10.2025", "12:30", "Джонсон Э.", "https://zoom.us/j/122"),

    # ПЯТНИЦА
    ("Литература", "10.10.2025", "09:00", "Смирнова Л.Н.", "https://zoom.us/j/123"),
    ("Информатика", "10.10.2025", "10:45", "Сидоров Н.Н.", "https://zoom.us/j/124"),
    ("Физика", "10.10.2025", "12:30", "Ким Л.С.", "https://zoom.us/j/125"),
]

cursor.executemany('''
    INSERT INTO schedule (subject, date, time, teacher, link)
    VALUES (?, ?, ?, ?, ?)
''', lessons)

conn.commit()
conn.close()
print("✅ Расписание на неделю успешно добавлено!")
